//=====================================
//
//スコア表示ヘッダ[score.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _SCORE_H_
#define _SCORE_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitScore(int num);
void UninitScore(int num);
void UpdateScore(void);
void DrawScore(int score1P, int score2P);

#endif