//=====================================
//
//スクロールスピードコントローラ処理[scrollSpeedController.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "scrollSpeedController.h"

#include "gameParameter.h"

/**************************************
マクロ定義
***************************************/
#define SCROLLSPEEDCONTROLLER_DELTA_VALUE	(0.8f)
#define SCROLLSPEEDCONTROLLER_DELTA_MAX		(1.0f)

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/
static float targetSpeed[TARGETPLAYER_MAX];

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
初期化処理
***************************************/
void InitScrollSpeedController(int num)
{
	
}

/**************************************
更新処理
***************************************/
void UpdateScrollSpeedController(void)
{
	for (int i = 0; i < TARGETPLAYER_MAX; i++)
	{

	}
}