//=====================================
//
//タイムGUIヘッダ[timeGUI.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _TIMEGUI_H_
#define _TIMEGUI_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitTimeGUI(int num);
void UninitTimeGUI(int num);
void UpdateTimeGUI(void);
void DrawTimeGUI(float time1P, float time2P);

#endif