//=====================================
//
//タイトルシーンGUI処理[titleSceneGUI.cpp]
//Author:GP11A341 21 立花雄太
//
//=====================================
#include "GUIManager.h"
#include "titleScene.h"

#include "titleLogo.h"
#include "entryGUI.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
グローバル変数
***************************************/

/**************************************
プロトタイプ宣言
***************************************/

/**************************************
初期化処理
***************************************/
void InitTitleSceneGUI(void)
{
	InitTitleLogo(0);
	InitEntryGUI(0);
}

/**************************************
終了処理
***************************************/
void UninitTitleSceneGUI(void)
{
	UninitTitleLogo(0);
	UninitEntryGUI(0);
}

/**************************************
更新処理
***************************************/
void UpdateTitleSceneGUI(void)
{
	UpdateTitleLogo();
	UpdateEntryGUI();
}

/**************************************
描画処理
***************************************/
void DrawTitleSceneGUI(void)
{
	//ロゴ描画
	DrawTitleLogo();

	//エントリーGUIをそれぞれ描画
	for (int i = 0; i < TARGETPLAYER_MAX; i++)
	{
		bool state = GetEntryState(i);
		SetEntryGUI(i, state);
		DrawEntryGUI();
	}
}
