//=====================================
//
//タイトルロゴヘッダ[titleLogo.h]
//Author:GP11A341 21 立花雄太
//
//=====================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

#include "main.h"

/**************************************
マクロ定義
***************************************/

/**************************************
構造体定義
***************************************/

/**************************************
プロトタイプ宣言
***************************************/
void InitTitleLogo(int num);
void UninitTitleLogo(int num);
void UpdateTitleLogo(void);
void DrawTitleLogo(void);

#endif